# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name corn1 -T {25} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0}
create_library_set -name timing -timing {../techFiles/sky130_fd_sc_hd__tt_025C_1v80.lib}
create_constraint_mode -name constraint_1 -sdc_files {src/mestpro.sdc}
create_delay_corner -name delay_1 -library_set {timing}
create_analysis_view -name analysis_1 -constraint_mode {constraint_1} -delay_corner {delay_1}
set_analysis_view -setup {analysis_1} -hold {analysis_1}
